// << , >>
/*
 *    10 << 2
 *   ----   
 *   1010
 *       ----==>1010(00) == 40
 *   =>1010 뒤에 0을 2개 채운다.
 *   
 *    7 << 3
 *   ---
 *   111
 *      ----==> 111000 == 56
 *    8 << 2
 *   ---
 *   1000
 *      ----==> 100000 == 32
 *   
 *   x << y ==> x * 2^y
 *   
 *   9 << 3==> 9 * 2^3 == 72
 *   ===========================
 *    10 >> 2
 *   ----
 *   1010----
 *     --제거 ==>10 == 2
 *   
 *    15 >> 3
 *   ----
 *   1111----
 *    ---제거 ==>1 == 1 
 *    
 *    27 >> 3 
 *   ----
 *  11011----
 *    ---제거 ==>11 == 3
 *  27 / 2^3 ==> 27/8 == 3
 *   
 *   x >> y ==> x / 2^y
 *   ===========================
 *        
 */
public class 쉬프트연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println(10<<2);//40
		System.out.println(7<<3);//56
		System.out.println(8<<2);//32
		System.out.println(10>>2);//2
		System.out.println(15>>3);//1
		

	}

}
